In [1]:
#Import Dependencies
import pandas as pd
import matplotlib as plt
import numpy as np
from config import (user, password)

In [2]:
#Create Engine and Connect to Database
from sqlalchemy import create_engine
engine = create_engine(f"postgresql://{user}:{password}@localhost:5432/employee_db")
conn = engine.connect()

In [3]:
#Query the Salary Table
salary_data = pd.read_sql("select * from salaries", conn)
salary_data.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [14]:
#Query the Employees Table
employee_data = pd.read_sql("select * from employees", conn)

employee_data.rename(columns={"emp_title_id": "title_id"}, inplace=True)
employee_data.head()

   emp_no title_id  birth_date  first_name  last_name sex   hire_date
0  473302    s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053    e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444    e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786    s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238    e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [4]:
#Query the Title Table
title_data = pd.read_sql("select * from titles", conn)
title_data.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [18]:
#Merge and Combine Data
combined_data1 = pd.merge(employee_data, title_data, on="title_id", how="inner")

combined_data2 = pd.merge(combined_data1, salary_data, on="emp_no", how="inner")
combined_data2.head()

,emp_no,title_id,birth_date,first_name,last_name,sex,hire_date,title,salary
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,Staff,40000
1,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,Staff,40000
2,273487,s0001,1957-04-14,Christoph,Parfitt,M,1991-06-28,Staff,56087
3,246449,s0001,1958-03-23,Subbu,Bultermann,F,1988-03-25,Staff,87084
4,48085,s0001,1964-01-19,Venkatesan,Gilg,M,1993-06-28,Staff,63016

In [19]:
#Groupby Title
grouped_df = combined_data2.groupby("title").mean()
grouped_df

                           emp_no        salary
title
Assistant Engineer  252992.595373  48564.434447
Engineer            253654.345919  48535.336511
Manager             110780.833333  51531.041667
Senior Engineer     253038.749885  48506.799871
Senior Staff        254481.798969  58550.172704
Staff               253408.503604  58465.382850
Technique Leader    251811.432730  48582.896092

In [21]:
#Drop Unnecessary Columns
cleaned_grouped_df = grouped_df.drop(columns="emp_no")
cleaned_grouped_df

                          salary
title
Assistant Engineer  48564.434447
Engineer            48535.336511
Manager             51531.041667
Senior Engineer     48506.799871
Senior Staff        58550.172704
Staff               58465.382850
Technique Leader    48582.896092